# Introduction to pandas

In [53]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

[`Pandas`](https://pandas.pydata.org/docs/index.html) is a powerful and widely-used open-source Python library designed for data manipulation and analysis. At the heart of pandas are two primary data structures: **series** and **data frames**. These data structures serve as the foundational building blocks for everything that is nice about `pandas`.

- [`Series`](https://pandas.pydata.org/docs/reference/api/pandas.Series.html#pandas.Series):  a one-dimensional labeled array holding data of any type
such as integers, strings, Python objects etc.
- [`DataFrame`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame): a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

## Creating Series and DataFrame Objects

Let's start by manually creating a simple series object:

In [54]:
s = pd.Series([1, 3, 5, 7])
s

0    1
1    3
2    5
3    7
dtype: int64

To manually create a DataFrame, we can do so from a dictionary like follows:

In [55]:
df = pd.DataFrame({
    "first_name": ["Knute", "Frank", "Ara", "Dan", "Lou", "Marcus"],
    "last_name": ["Rockne", "Leahy", "Parseghian", "Devine", "Holtz", "Freeman"],
    "win_percent": [0.881, 0.855, 0.836, 0.764, 0.765, 0.786]
})
df

  first_name   last_name  win_percent
0      Knute      Rockne        0.881
1      Frank       Leahy        0.855
2        Ara  Parseghian        0.836
3        Dan      Devine        0.764
4        Lou       Holtz        0.765
5     Marcus     Freeman        0.786

It is also possible to create a DataFrame from a numpy array:

In [56]:
pd.DataFrame(np.random.randn(6, 4), columns=list("ABCD"))

          A         B         C         D
0  1.305479  0.021004  0.681953 -0.310267
1  0.324166 -0.130143  0.096996  0.595157
2 -0.818221  2.092387 -1.006017 -1.214189
3  1.158111  0.791663  0.624120  0.628346
4 -0.012247 -0.897254  0.075805 -0.677162
5  0.975120 -0.147057 -0.825497 -0.321386

## Exploring DataFrames

The data above are quite small in comparison to datasets that we might see in practice. For larger datasets, it is crucial to be able to obtain a quick overview or glimpse of the overall data structure. 

- `.info()`: provides a concise summary of the DataFrame
- `.describe()`: provides a quick statistical summary of numeric columns in the DataFrame
- `.head()`: prints the top five rows of the DataFrame
- `.tail()`: prints the bottom five rows of the DataFrame
- `.shape`: outputs the dimensions of the DataFrame (# rows, # columns)
- `.dtypes`: lists the data type of each column in the DataFrame
- `.columns`: lists the column names in the DataFrame
- `.index`: lists the indexes or row names in the DataFrame

In [57]:
df.info()  # general info/summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   6 non-null      object
 1   last_name    6 non-null      object
 2   win_percent  6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 276.0+ bytes

In [58]:
df.describe()  # statistical summary of numeric columns

       win_percent
count     6.000000
mean      0.814500
std       0.049674
min       0.764000
25%       0.770250
50%       0.811000
75%       0.850250
max       0.881000

In [59]:
df.head()  # first five rows

  first_name   last_name  win_percent
0      Knute      Rockne        0.881
1      Frank       Leahy        0.855
2        Ara  Parseghian        0.836
3        Dan      Devine        0.764
4        Lou       Holtz        0.765

In [60]:
df.tail()  # bottom five rows

  first_name   last_name  win_percent
1      Frank       Leahy        0.855
2        Ara  Parseghian        0.836
3        Dan      Devine        0.764
4        Lou       Holtz        0.765
5     Marcus     Freeman        0.786

In [61]:
df.shape  # dimensions

(6, 3)

In [62]:
df.dtypes  # data types of each column

first_name      object
last_name       object
win_percent    float64
dtype: object

In [63]:
df.columns  # column names

Index(['first_name', 'last_name', 'win_percent'], dtype='object')

In [64]:
df.index  # row names

RangeIndex(start=0, stop=6, step=1)

**Exercise 1.** Print the number of rows in `df`.

## Selection

Once we have a DataFrame object, there are many ways to select/filter columns and rows. In this section, we will review the different ways to perform this selection.

### Get Item (`[]`)

If we pass a single label to a DataFrame using `[]`, this selects a column in the DataFrame and yields a Series object.

In [65]:
df["first_name"]

0     Knute
1     Frank
2       Ara
3       Dan
4       Lou
5    Marcus
Name: first_name, dtype: object

This is equivalent to:

In [66]:
df.first_name

0     Knute
1     Frank
2       Ara
3       Dan
4       Lou
5    Marcus
Name: first_name, dtype: object

If we want to select multiple columns in the DataFrame, we can instead pass a list of column names such as:

In [67]:
df[["first_name", "last_name"]]

  first_name   last_name
0      Knute      Rockne
1      Frank       Leahy
2        Ara  Parseghian
3        Dan      Devine
4        Lou       Holtz
5     Marcus     Freeman

On the other hand, passing a slice using `:` selects matching rows:

In [68]:
df[0:3]

  first_name   last_name  win_percent
0      Knute      Rockne        0.881
1      Frank       Leahy        0.855
2        Ara  Parseghian        0.836

**Exercise 2.** Subset the DataFrame `df` to get the last 4 rows. Then, print out the dimensions of this resulting DataFrame.

### Selection by Label vs Position

As an alternative to using `[]`, there are two methods `.loc()` and `.iloc()` that provide a more flexible alternative for subsetting a DataFrame by label (`.loc()`) or by position (`.iloc()`). In particular, `.loc()` and `.iloc()` allow us to subset both rows and columns in a DataFrame in a single call.

For example, suppose we want to extract the first two columns (i.e., the `first_name` and `last_name`) from `df`. The following two code chunks are equivalent approaches to achieve this. Note the `:` in the first component of `[]` means to select all rows.

In [69]:
df.loc[:, ["first_name", "last_name"]]

  first_name   last_name
0      Knute      Rockne
1      Frank       Leahy
2        Ara  Parseghian
3        Dan      Devine
4        Lou       Holtz
5     Marcus     Freeman

In [70]:
# this would return an IndexError if uncommented
# df.iloc[:, ["first_name", "last_name"]]
df.iloc[:, 0:2]

  first_name   last_name
0      Knute      Rockne
1      Frank       Leahy
2        Ara  Parseghian
3        Dan      Devine
4        Lou       Holtz
5     Marcus     Freeman

**Exercise 3.** As seen above, `df.iloc[:, 0:2]` returns the first two columns of `df`. If you try to run `df.loc[:, 0:2]` instead, this will return an Index Error. However, both `df.iloc[0:2, :]` and `df.loc[0:2, :]` run without error (you can try this out for yourself). Do these two commands (i.e., `df.iloc[0:2, :]` and `df.loc[0:2, :]`) give the same results? Can you explain this phenomenon?

**Exercise 4.** Try running `df.loc[:, ["first_name"]]` amd `df.loc[:, "first_name"]`. Do they give the same result?

As alluded to previously, it is possible to select both a subset of rows and columns using either `.iloc()` or `loc()`.

For example, the code below selects the rows labeled 0, 2, and 5 and columns "first_name" and "win_percent".

In [71]:
df.loc[[0, 2, 5], ["first_name", "win_percent"]]

  first_name  win_percent
0      Knute        0.881
2        Ara        0.836
5     Marcus        0.786

Since the indexes match the row positions, we could have equivalently subsetted the DataFrame using `.iloc()` as follows:

In [72]:
df.iloc[[0, 2, 5], [0, 2]]

  first_name  win_percent
0      Knute        0.881
2        Ara        0.836
5     Marcus        0.786

**Exercise 5.** Extract the first 3 rows of the columns named `"col1"` and `"col50"` in `df2` below.

In [73]:
col_names = np.random.choice(["col" + str(i) for i in range(100)], 100, replace=False)
row_names = np.random.choice(["row" + str(i) for i in range(100)], 100, replace=False)
df2 = pd.DataFrame(np.random.randn(100, 100), columns=col_names, index=row_names)
df2

,col33,col25,col29,col50,col94,col89,col23,col1,col52,col93,...,col41,col39,col12,col45,col6,col16,col57,col73,col8,col75
row90,-2.029231,1.961303,-0.263242,0.534809,1.905907,0.227602,-0.194670,1.419673,0.460737,0.586106,...,-1.746162,2.616700,-0.430792,0.494567,0.640582,-0.814784,1.846980,0.265955,-0.213473,0.138508
row40,0.764252,0.010798,0.881930,-1.684872,-0.747970,-2.138800,1.997008,1.983992,0.626616,-1.012618,...,0.537766,-1.358712,1.397164,-0.690399,0.616216,-0.630413,-0.915241,0.246104,1.051783,-0.247368
row87,-0.065477,0.807417,0.840527,-0.038492,-0.443480,0.082656,-0.190911,0.312974,-1.194270,0.277182,...,0.617390,-1.200170,-1.044495,-0.222395,0.297307,0.622800,0.950178,0.539572,1.346746,0.126793
row19,-0.759639,-0.003351,-0.068981,-2.578215,-0.561367,0.314204,-0.424216,-0.646209,0.911376,-0.916546,...,0.640904,-0.171913,-0.024277,-0.555224,-1.605409,0.567853,-0.806030,-0.200792,0.286974,-2.085218
row88,-1.861349,-0.299739,0.454563,0.744038,-1.591314,0.636631,-0.245070,-0.883157,-0.648552,0.801857,...,0.751903,0.976899,-0.695422,-0.041570,2.020402,-0.739874,-1.705087,1.382904,1.136605,-0.456967
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
row16,-0.439068,-0.327243,0.973754,-0.149791,-0.696386,-1.365518,0.360689,1.059476,-0.783128,0.688979,...,0.338316,-1.134381,-1.402473,-0.040216,-0.842513,0.938208,-1.500677,-1.418201,-0.416662,-1.538075
row62,1.676003,-0.182917,-0.602801,0.467964,0.883849,0.206959,-0.068091,-0.983473,0.630909,1.416703,...,-0.751806,-1.597024,-0.769053,0.794867,-0.392829,1.072442,0.693135,0.050453,1.096046,1.364416
row26,0.454387,0.229967,0.633369,-1.406587,-0.117571,-0.023991,-0.368744,-0.789496,0.998045,0.170058,...,-0.700711,1.319105,-0.335229,1.727326,1.936586,2.113684,-0.058767,0.210357,0.377956,-0.367488
row63,0.424370,-0.935196,-1.875476,0.714135,-0.349773,-0.976692,-0.850226,1.515122,0.464113,-1.522307,...,1.380032,0.200697,0.889286,0.080673,0.127006,-0.634929,1.928859,0.742844,0.521805,0.770295
row99,-0.677290,0.930972,1.555881,-1.380698,0.541563,0.062790,-0.519185,-1.093256,1.051920,0.207990,...,0.655225,-0.081546,0.464879,1.089593,0.181472,-0.521232,-0.220226,0.751864,-0.491263,0.889066

### Boolean Indexing

It is also possible to select or filter rows/columns using boolean indexes. For example, if we want to select all coaches with a winning percentage greater than 0.8, we can do:

In [74]:
df[df["win_percent"] > 0.8]

  first_name   last_name  win_percent
0      Knute      Rockne        0.881
1      Frank       Leahy        0.855
2        Ara  Parseghian        0.836

Or if we want to get the coaches who's first name is either `"Marcus"` or `"Lou"`,

In [75]:
df[df["first_name"].isin(["Knute", "Lou"])]

  first_name last_name  win_percent
0      Knute    Rockne        0.881
4        Lou     Holtz        0.765

Or if we want to get the coaches who's last name contains an `"n"`

In [76]:
df[df["last_name"].str.contains("n", case=False)]

  first_name   last_name  win_percent
0      Knute      Rockne        0.881
2        Ara  Parseghian        0.836
3        Dan      Devine        0.764
5     Marcus     Freeman        0.786

Or if we want to get the coaches who's last name contains an `"n"` and has a winning percentage greater than 0.8

In [77]:
df[df["last_name"].str.contains("n") & (df["win_percent"] > 0.8)]

  first_name   last_name  win_percent
0      Knute      Rockne        0.881
2        Ara  Parseghian        0.836

**Exercise 6.** Extract the subset of rows from `df` corresponding to the coaches who's last name contains an `"n"` or has a winning percentage greater than 0.8.

### Setting/Removing

To set a new column in the DataFrame, you can use the following syntax:

In [78]:
df["n_championships"] = ["3", "4", "2", "1", "1", "1?"]
df

  first_name   last_name  win_percent n_championships
0      Knute      Rockne        0.881               3
1      Frank       Leahy        0.855               4
2        Ara  Parseghian        0.836               2
3        Dan      Devine        0.764               1
4        Lou       Holtz        0.765               1
5     Marcus     Freeman        0.786              1?

It is also possible to create a new column using a Series object:

In [79]:
df["n_championships"] = pd.Series(["3", "4", "2", "1", "1", "1?"])

However, it is important to note that setting a new column automatically aligns the data by the indexes. In the extreme case, when the indexes do not match like below, the resulting new column will be all NAs.

In [80]:
champs = pd.Series(
    ["3", "4", "2", "1", "1", "1?"], 
    index=["Knute", "Frank", "Ara", "Dan", "Lou", "Marcus"]
)
df["n_championships"] = champs
df

  first_name   last_name  win_percent n_championships
0      Knute      Rockne        0.881             NaN
1      Frank       Leahy        0.855             NaN
2        Ara  Parseghian        0.836             NaN
3        Dan      Devine        0.764             NaN
4        Lou       Holtz        0.765             NaN
5     Marcus     Freeman        0.786             NaN

**Exercise 7.** Fix the above code chunk so that the number of championships for each coach is correct.

To change a particular entry in the DataFrame, we can combine methods for selection discussed previously and `=`, e.g.,

In [81]:
df.loc[df["first_name"] == "Dan", "first_name"] = "Daniel"
df

  first_name   last_name  win_percent n_championships
0      Knute      Rockne        0.881             NaN
1      Frank       Leahy        0.855             NaN
2        Ara  Parseghian        0.836             NaN
3     Daniel      Devine        0.764             NaN
4        Lou       Holtz        0.765             NaN
5     Marcus     Freeman        0.786             NaN

**Exercise 8.** Change the number of championships won by Marcus Freeman to `"1"`. Then change the `"n_championships"` column from a string to an integer.

To remove a column, use the drop method:

In [82]:
df.drop("n_championships", axis=1)

  first_name   last_name  win_percent
0      Knute      Rockne        0.881
1      Frank       Leahy        0.855
2        Ara  Parseghian        0.836
3     Daniel      Devine        0.764
4        Lou       Holtz        0.765
5     Marcus     Freeman        0.786

**Exercise 9.** Remove both the `"win_percent"` and the `"n_championships"` columns from `df`.

## Rename

To rename columns, DataFrames have a `.rename()` method:

In [83]:
df.rename(columns={"first_name": "first", "last_name": "last"}, inplace=True)
df

    first        last  win_percent n_championships
0   Knute      Rockne        0.881             NaN
1   Frank       Leahy        0.855             NaN
2     Ara  Parseghian        0.836             NaN
3  Daniel      Devine        0.764             NaN
4     Lou       Holtz        0.765             NaN
5  Marcus     Freeman        0.786             NaN

**Exercise 10.** Notice that dropping the columns earlier does not remove the columns in place (i.e., you must set `df = df.drop(...)` in order to store the result with the specified columns removed). Does renaming using `df.rename()` rename the columns in place?

## Sorting

To sort rows/columns, we can sort either by the DataFrame's index/column names or by values in particular column(s).

In [84]:
# sorting columns by column name
df.sort_index(axis=1, ascending=True)

    first        last n_championships  win_percent
0   Knute      Rockne             NaN        0.881
1   Frank       Leahy             NaN        0.855
2     Ara  Parseghian             NaN        0.836
3  Daniel      Devine             NaN        0.764
4     Lou       Holtz             NaN        0.765
5  Marcus     Freeman             NaN        0.786

In [85]:
# sort first by winning percentage
df.sort_values(by=["win_percent"], ascending=False)

    first        last  win_percent n_championships
0   Knute      Rockne        0.881             NaN
1   Frank       Leahy        0.855             NaN
2     Ara  Parseghian        0.836             NaN
5  Marcus     Freeman        0.786             NaN
4     Lou       Holtz        0.765             NaN
3  Daniel      Devine        0.764             NaN

**Exercise 11.** Sort the coaches first by number of championships and then by winning percentage to break any ties in the number of championships.

## Grouping and Aggregation

In `pandas`, we can "group" DataFrames by particular column(s), so that subsequent operations are applied to each group independently. What does this mean? This is best illustrated with an example.

In [86]:
df = pd.DataFrame({
    "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
    "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
    "C": np.random.randn(8),
    "D": np.random.randn(8),
})
df

     A      B         C         D
0  foo    one  1.908598 -0.389463
1  bar    one  0.901462 -0.028992
2  foo    two  0.747136  0.418656
3  bar  three  0.347632 -0.840421
4  foo    two -0.776869 -0.501924
5  bar    two -0.867582  0.322883
6  foo    one -0.877622 -0.290854
7  foo  three  0.554732 -0.197451

Given this dataset, suppose we want to compute the mean for each unique combination of `("A", "B")` values. Rather than manually subsetting the DataFrame to the relevant rows, we can simply "group" the DataFrame by columns `"A"` and `"B"` and apply the mean function as follows:

In [87]:
df.groupby(["A", "B"]).mean()

                  C         D
A   B
bar one    0.901462 -0.028992
    three  0.347632 -0.840421
    two   -0.867582  0.322883
foo one    0.515488 -0.340158
    three  0.554732 -0.197451
    two   -0.014867 -0.041634

**Exercise 12.** What if we wanted to compute the mean of columns `"C"` and `"D"` within each group, defined by only column `"A"` (not columns `"A"` and `"B"`)?

## Concatenating

To combine two DataFrames by concatenating columns or rows, we can use `pd.concat()`. Setting `axis=1` concatenates the two DataFrames by column while `axis=0` concatenates by row.

In [88]:
df1  = pd.DataFrame({
    "uppercase": ["A", "B", "C"]
})
df2 = pd.DataFrame({
    "lowercase": ["a", "b", "c"]
})
# concatenate along the columns
pd.concat([df1, df2], axis=1)

  uppercase lowercase
0         A         a
1         B         b
2         C         c

In [89]:
df1 = pd.DataFrame({
    "a": [1, 2, 3],
    "b": [2, 3, 4],
    "c": [3, 4, 5]
})
df2 = pd.DataFrame({
    "a": [4, 5, 6],
    "b": [5, 6, 7],
    "c": [6, 7, 8]
})
# concatenate along the rows
pd.concat([df1, df2], axis=0)

   a  b  c
0  1  2  3
1  2  3  4
2  3  4  5
0  4  5  6
1  5  6  7
2  6  7  8

Note that concatenation uses the indexes to "match" rows or columns.

In [90]:
df1  = pd.DataFrame({
    "uppercase": ["A", "B", "C"],
},
index=["one", "two", "three"])
df2 = pd.DataFrame({
    "lowercase": ["a", "b", "c"]
})
# concatenate along the columns, but indexes do not line up so NaNs are filled in
pd.concat([df1, df2], axis=1)

      uppercase lowercase
one           A       NaN
two           B       NaN
three         C       NaN
0           NaN         a
1           NaN         b
2           NaN         c

In [91]:
df1 = pd.DataFrame({
    "a": [1, 2, 3],
    "b": [2, 3, 4],
    "c": [3, 4, 5]
})
df2 = pd.DataFrame({
    "b": [5, 6, 7],
    "a": [4, 5, 6]
})
# concatenate along the rows
pd.concat([df1, df2], axis=0)

   a  b    c
0  1  2  3.0
1  2  3  4.0
2  3  4  5.0
0  4  5  NaN
1  5  6  NaN
2  6  7  NaN

**Exercise 13.** Without modifying `champs_df` below, please concatenate the following two DataFrames so that each coach has the correct number of championships assigned to them.

In [92]:
win_df = pd.DataFrame({
    "first_name": ["Knute", "Frank", "Ara", "Dan", "Lou", "Marcus"],
    "last_name": ["Rockne", "Leahy", "Parseghian", "Devine", "Holtz", "Freeman"],
    "win_percent": [0.881, 0.855, 0.836, 0.764, 0.765, 0.786]
})
champs_df = pd.DataFrame({
    "last": ["Rockne", "Leahy", "Parseghian", "Devine", "Holtz", "Freeman"],
    "n_championships": ["3", "4", "2", "1", "1", "1?"]
}, index=["Knute", "Frank", "Ara", "Dan", "Lou", "Marcus"])
win_df, champs_df

(  first_name   last_name  win_percent
 0      Knute      Rockne        0.881
 1      Frank       Leahy        0.855
 2        Ara  Parseghian        0.836
 3        Dan      Devine        0.764
 4        Lou       Holtz        0.765
 5     Marcus     Freeman        0.786,
               last n_championships
 Knute       Rockne               3
 Frank        Leahy               4
 Ara     Parseghian               2
 Dan         Devine               1
 Lou          Holtz               1
 Marcus     Freeman              1?)

Sometimes, it can be helpful to reset the indexes back to the usual "position" indexes. This can be done using `.reset_index()`. For example,

In [93]:
champs_df.reset_index()

    index        last n_championships
0   Knute      Rockne               3
1   Frank       Leahy               4
2     Ara  Parseghian               2
3     Dan      Devine               1
4     Lou       Holtz               1
5  Marcus     Freeman              1?

**Exercise 14.** Compare `champs_df.reset_index(drop=False)` versus `champs_df.reset_index(drop=True)`. What is the difference?

**Exercise 15.** Use `.reset_index()` to modify `champs_df` in order to concatenate `champs_df` and `win_df`

In [94]:
win_df = pd.DataFrame({
    "first_name": ["Knute", "Frank", "Ara", "Dan", "Lou", "Marcus"],
    "last_name": ["Rockne", "Leahy", "Parseghian", "Devine", "Holtz", "Freeman"],
    "win_percent": [0.881, 0.855, 0.836, 0.764, 0.765, 0.786]
})
champs_df = pd.DataFrame({
    "last": ["Rockne", "Leahy", "Parseghian", "Devine", "Holtz", "Freeman"],
    "n_championships": ["3", "4", "2", "1", "1", "1?"]
}, index=["Knute", "Frank", "Ara", "Dan", "Lou", "Marcus"])

## Joining

Now, rather than simply concatenating datasets by rows or columns, we often want to merge datasets based upon common IDs (or columns(s)). This data manipulation is often called "joining" two datasets, and there are different types of "joins":

-   "inner join": keep only rows that have matching IDs in both datasets
-   "full (or outer) join": keep all rows from both datasets (don't need to have matching IDs)
-   "left join": keep all rows from the first (i.e., left) dataset and only matching rows from the second dataset
-   "right join": keep all rows from the second (i.e., right) dataset and only matching rows from the first dataset

![](https://data-lessons.github.io/gapminder-R/fig/dplyr-joins.png)

To illustrate the differences between these joins, let's try joining the following two datasets: `band_members` and `band_instruments`. Both datasets have column named `name` which we will use as the "ID" to join the datasets.

In [95]:
band_members = pd.DataFrame({
    "name": ["Mick", "John", "Paul"],
    "band": ["Stones", "Beatles", "Beatles"]
})
band_members

   name     band
0  Mick   Stones
1  John  Beatles
2  Paul  Beatles

In [96]:
band_instruments = pd.DataFrame({
    "name": ["John", "Paul", "Keith"],
    "instrument": ["guitar", "bass", "guitar"],
})
band_instruments

    name instrument
0   John     guitar
1   Paul       bass
2  Keith     guitar

In [97]:
# keeps people who are in both datasets
pd.merge(band_members, band_instruments, on="name", how="inner")

   name     band instrument
0  John  Beatles     guitar
1  Paul  Beatles       bass

In [98]:
# keeps all people from both datasets
pd.merge(band_members, band_instruments, on="name", how="outer")

    name     band instrument
0   John  Beatles     guitar
1  Keith      NaN     guitar
2   Mick   Stones        NaN
3   Paul  Beatles       bass

In [99]:
# keeps all people in the left (band_members) dataset
pd.merge(band_members, band_instruments, on="name", how="left")

   name     band instrument
0  Mick   Stones        NaN
1  John  Beatles     guitar
2  Paul  Beatles       bass

In [100]:
# keeps all people in the right (band_members) dataset
pd.merge(band_members, band_instruments, on="name", how="right")

    name     band instrument
0   John  Beatles     guitar
1   Paul  Beatles       bass
2  Keith      NaN     guitar

If the "ID" column(s) have different names in the two datasets, you can specify the columns to join on using the `left_on` and `right_on` arguments. For example,

In [101]:
win_df = pd.DataFrame({
    "first_name": ["Knute", "Frank", "Ara", "Dan", "Lou", "Marcus"],
    "last_name": ["Rockne", "Leahy", "Parseghian", "Devine", "Holtz", "Freeman"],
    "win_percent": [0.881, 0.855, 0.836, 0.764, 0.765, 0.786]
})
champs_df = pd.DataFrame({
    "first": ["Knute", "Frank", "Ara", "Dan", "Lou", "Marcus"],
    "last": ["Rockne", "Leahy", "Parseghian", "Devine", "Holtz", "Freeman"],
    "n_championships": ["3", "4", "2", "1", "1", "1?"]
})
pd.merge(win_df, champs_df, 
         left_on=["first_name", "last_name"], 
         right_on=["first", "last"], 
         how="inner")

  first_name   last_name  win_percent   first        last n_championships
0      Knute      Rockne        0.881   Knute      Rockne               3
1      Frank       Leahy        0.855   Frank       Leahy               4
2        Ara  Parseghian        0.836     Ara  Parseghian               2
3        Dan      Devine        0.764     Dan      Devine               1
4        Lou       Holtz        0.765     Lou       Holtz               1
5     Marcus     Freeman        0.786  Marcus     Freeman              1?

**Exercise 16.** Merge the `band_members` and `band_instruments2` datasets such that all band members in the `band_members` dataset are kept.

In [102]:
band_instruments2 = pd.DataFrame({
    "artist": ["John", "Paul", "Keith"],
    "instrument": ["guitar", "bass", "guitar"],
})
band_instruments2

  artist instrument
0   John     guitar
1   Paul       bass
2  Keith     guitar

## Plotting

There will be plenty of opportunities to hone your plotting abilities throughout the semester. Because of this, we won't dwell on plotting too much here, except to check your familiarity with the very basics of matplotlib and seaborn.

**Exercise 17.** Using `win_df`, make a bar plot with the coach on the x-axis and their winning percentage on the y-axis. In addition, can you sort the coaches so that their winning percentages are decreasing from left to right in the plot?

In [103]:
win_df = pd.DataFrame({
    "first_name": ["Knute", "Frank", "Ara", "Dan", "Lou", "Marcus"],
    "last_name": ["Rockne", "Leahy", "Parseghian", "Devine", "Holtz", "Freeman"],
    "win_percent": [0.881, 0.855, 0.836, 0.764, 0.765, 0.786]
})

**Exercise 18.** Below, I've computed a correlation matrix with the pairwise correlations between every two pair of columns in `data`. Please use [`seaborn`](https://seaborn.pydata.org/) to plot this correlation matrix as a heatmap (often called a correlation heatmap).

In [104]:
np.random.seed(42)
data = pd.DataFrame({
    'A': np.random.rand(100),
    'B': np.random.rand(100),
    'C': np.random.rand(100),
    'D': np.random.rand(100)
})

# Compute the correlation matrix
correlation_matrix = data.corr()